perftests/segmentio/smol-run3.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0009 secs
  Slowest:	0.1522 secs
  Fastest:	0.0000 secs
  Average:	0.0060 secs
  Requests/sec:	46608.7463
  
  Total data:	53132778 bytes
  Size/request:	53 bytes

Response time histogram:
  0.000 [1]	|
  0.015 [961178]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.030 [30597]	|■
  0.046 [5201]	|
  0.061 [1487]	|
  0.076 [487]	|
  0.091 [383]	|
  0.107 [59]	|
  0.122 [4]	|
  0.137 [69]	|
  0.152 [534]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0016 secs
  50% in 0.0027 secs
  75% in 0.0044 secs
  90% in 0.0075 secs
  95% in 0.0126 secs
  99% in 0.0282 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1522 secs
  DNS-lookup:	0.0005 secs, 0.0000 secs, 0.1510 secs
  req write:	0.0000 secs, 0.0000 secs, 0.1427 secs
  resp wait:	0.0054 secs, 0.0000 secs, 0.1496 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.1366 secs

Status code distribution:
  [200]	1000000 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62383->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62384->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62385->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62386->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62387->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62388->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62389->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62390->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62391->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62392->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62393->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62394->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62395->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62396->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62397->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62398->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62399->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62400->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62401->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62402->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62403->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62404->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62405->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62406->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62407->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62408->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62409->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62410->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62411->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62412->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62413->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62414->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62415->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62416->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62417->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62418->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62419->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62420->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62421->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62422->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62423->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62424->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62425->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62426->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62427->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62428->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62429->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62430->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62431->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62432->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62433->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62434->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62435->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62436->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62437->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62438->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62439->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62440->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62441->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62442->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62443->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62444->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62445->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62446->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62447->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62448->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62449->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62450->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62451->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62452->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62453->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:62454->127.0.0.1:9000: read: connection reset by peer